zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_AXBS.h
/*! @name PRS1 - Priority Target Registers */
/*! @{ */

#define AXBS_PRS1_M0_MASK                        (0x7U)
#define AXBS_PRS1_M0_SHIFT                       (0U)
/*! M0 - Initiator 0 Priority
 *  0b000..This initiator has level 1 or highest priority when accessing the target port.
 *  0b001..This initiator has level 2 priority when accessing the target port.
 *  0b010..This initiator has level 3 priority when accessing the target port.
 *  0b011..This initiator has level 4 priority when accessing the target port.
 *  0b100..This initiator has level 5 priority when accessing the target port.
 *  0b101..This initiator has level 6 priority when accessing the target port.
 *  0b110..This initiator has level 7 priority when accessing the target port.
 *  0b111..This initiator has level 8 or the lowest priority when accessing the target port.
 */
#define AXBS_PRS1_M0(x)                          (((uint32_t)(((uint32_t)(x)) << AXBS_PRS1_M0_SHIFT)) & AXBS_PRS1_M0_MASK)

#define AXBS_PRS1_M1_MASK                        (0x70U)
#define AXBS_PRS1_M1_SHIFT                       (4U)
/*! M1 - Initiator 1 Priority
 *  0b000..This initiator has level 1 or highest priority when accessing the target port.
 *  0b001..This initiator has level 2 priority when accessing the target port.
 *  0b010..This initiator has level 3 priority when accessing the target port.
 *  0b011..This initiator has level 4 priority when accessing the target port.
 *  0b100..This initiator has level 5 priority when accessing the target port.
 *  0b101..This initiator has level 6 priority when accessing the target port.
 *  0b110..This initiator has level 7 priority when accessing the target port.
 *  0b111..This initiator has level 8 or lowest priority when accessing the target port.
 */
#define AXBS_PRS1_M1(x)                          (((uint32_t)(((uint32_t)(x)) << AXBS_PRS1_M1_SHIFT)) & AXBS_PRS1_M1_MASK)

#define AXBS_PRS1_M2_MASK                        (0x700U)
#define AXBS_PRS1_M2_SHIFT                       (8U)
/*! M2 - Initiator 2 Priority
 *  0b000..This initiator has level 1 or highest priority when accessing the target port.
 *  0b001..This initiator has level 2 priority when accessing the target port.
 *  0b010..This initiator has level 3 priority when accessing the target port.
 *  0b011..This initiator has level 4 priority when accessing the target port.
 *  0b100..This initiator has level 5 priority when accessing the target port.
 *  0b101..This initiator has level 6 priority when accessing the target port.
 *  0b110..This initiator has level 7 priority when accessing the target port.
 *  0b111..This initiator has level 8 or the lowest priority when accessing the target port.
 */
#define AXBS_PRS1_M2(x)                          (((uint32_t)(((uint32_t)(x)) << AXBS_PRS1_M2_SHIFT)) & AXBS_PRS1_M2_MASK)

#define AXBS_PRS1_M3_MASK                        (0x7000U)
#define AXBS_PRS1_M3_SHIFT                       (12U)
/*! M3 - Initiator 3 Priority
 *  0b000..This initiator has level 1 or highest priority when accessing the target port.
 *  0b001..This initiator has level 2 priority when accessing the target port.
 *  0b010..This initiator has level 3 priority when accessing the target port.
 *  0b011..This initiator has level 4 priority when accessing the target port.
 *  0b100..This initiator has level 5 priority when accessing the target port.
 *  0b101..This initiator has level 6 priority when accessing the target port.
 *  0b110..This initiator has level 7 priority when accessing the target port.
 *  0b111..This initiator has level 8 or the lowest priority when accessing the target port.
 */
#define AXBS_PRS1_M3(x)                          (((uint32_t)(((uint32_t)(x)) << AXBS_PRS1_M3_SHIFT)) & AXBS_PRS1_M3_MASK)

#define AXBS_PRS1_M4_MASK                        (0x70000U)
#define AXBS_PRS1_M4_SHIFT                       (16U)
/*! M4 - Initiator 4 Priority
 *  0b000..This initiator has level 1 or highest priority when accessing the target port.
 *  0b001..This initiator has level 2 priority when accessing the target port.
 *  0b010..This initiator has level 3 priority when accessing the target port.
 *  0b011..This initiator has level 4 priority when accessing the target port.
 *  0b100..This initiator has level 5 priority when accessing the target port.
 *  0b101..This initiator has level 6 priority when accessing the target port.
 *  0b110..This initiator has level 7 priority when accessing the target port.
 *  0b111..This initiator has level 8 or the lowest priority when accessing the target port.
 */
#define AXBS_PRS1_M4(x)                          (((uint32_t)(((uint32_t)(x)) << AXBS_PRS1_M4_SHIFT)) & AXBS_PRS1_M4_MASK)

#define AXBS_PRS1_M5_MASK                        (0x700000U)
#define AXBS_PRS1_M5_SHIFT                       (20U)
/*! M5 - Initiator 5 Priority
 *  0b000..This initiator has level 1 or highest priority when accessing the target port.
 *  0b001..This initiator has level 2 priority when accessing the target port.
 *  0b010..This initiator has level 3 priority when accessing the target port.
 *  0b011..This initiator has level 4 priority when accessing the target port.
 *  0b100..This initiator has level 5 priority when accessing the target port.
 *  0b101..This initiator has level 6 priority when accessing the target port.
 *  0b110..This initiator has level 7 priority when accessing the target port.
 *  0b111..This initiator has level 8 or the lowest priority when accessing the target port.
 */
#define AXBS_PRS1_M5(x)                          (((uint32_t)(((uint32_t)(x)) << AXBS_PRS1_M5_SHIFT)) & AXBS_PRS1_M5_MASK)

#define AXBS_PRS1_M6_MASK                        (0x7000000U)
#define AXBS_PRS1_M6_SHIFT                       (24U)
/*! M6 - Initiator 6 Priority
 *  0b000..This initiator has level 1 or highest priority when accessing the target port.
 *  0b001..This initiator has level 2 priority when accessing the target port.
 *  0b010..This initiator has level 3 priority when accessing the target port.
 *  0b011..This initiator has level 4 priority when accessing the target port.
 *  0b100..This initiator has level 5 priority when accessing the target port.
 *  0b101..This initiator has level 6 priority when accessing the target port.
 *  0b110..This initiator has level 7 priority when accessing the target port.
 *  0b111..This initiator has level 8 or the lowest priority when accessing the target port.
 */
#define AXBS_PRS1_M6(x)                          (((uint32_t)(((uint32_t)(x)) << AXBS_PRS1_M6_SHIFT)) & AXBS_PRS1_M6_MASK)

#define AXBS_PRS1_M7_MASK                        (0x70000000U)
#define AXBS_PRS1_M7_SHIFT                       (28U)
/*! M7 - Initiator 7 Priority
 *  0b000..This initiator has level 1 or highest priority when accessing the target port.
 *  0b001..This initiator has level 2 priority when accessing the target port.
 *  0b010..This initiator has level 3 priority when accessing the target port.
 *  0b011..This initiator has level 4 priority when accessing the target port.
 *  0b100..This initiator has level 5 priority when accessing the target port.
 *  0b101..This initiator has level 6 priority when accessing the target port.
 *  0b110..This initiator has level 7 priority when accessing the target port.
 *  0b111..This initiator has level 8 or the lowest priority when accessing the target port.
 */
#define AXBS_PRS1_M7(x)                          (((uint32_t)(((uint32_t)(x)) << AXBS_PRS1_M7_SHIFT)) & AXBS_PRS1_M7_MASK)
/*! @} */

