zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_AXBS.h
#define AXBS_PRS5_M6_MASK                        (0x7000000U)
#define AXBS_PRS5_M6_SHIFT                       (24U)
/*! M6 - Initiator 6 Priority
 *  0b000..This initiator has level 1 or highest priority when accessing the target port.
 *  0b001..This initiator has level 2 priority when accessing the target port.
 *  0b010..This initiator has level 3 priority when accessing the target port.
 *  0b011..This initiator has level 4 priority when accessing the target port.
 *  0b100..This initiator has level 5 priority when accessing the target port.
 *  0b101..This initiator has level 6 priority when accessing the target port.
 *  0b110..This initiator has level 7 priority when accessing the target port.
 *  0b111..This initiator has level 8 or the lowest priority when accessing the target port.
 */
#define AXBS_PRS5_M6(x)                          (((uint32_t)(((uint32_t)(x)) << AXBS_PRS5_M6_SHIFT)) & AXBS_PRS5_M6_MASK)

#define AXBS_PRS5_M7_MASK                        (0x70000000U)
#define AXBS_PRS5_M7_SHIFT                       (28U)
/*! M7 - Initiator 7 Priority
 *  0b000..This initiator has level 1 or highest priority when accessing the target port.
 *  0b001..This initiator has level 2 priority when accessing the target port.
 *  0b010..This initiator has level 3 priority when accessing the target port.
 *  0b011..This initiator has level 4 priority when accessing the target port.
 *  0b100..This initiator has level 5 priority when accessing the target port.
 *  0b101..This initiator has level 6 priority when accessing the target port.
 *  0b110..This initiator has level 7 priority when accessing the target port.
 *  0b111..This initiator has level 8 or the lowest priority when accessing the target port.
 */
#define AXBS_PRS5_M7(x)                          (((uint32_t)(((uint32_t)(x)) << AXBS_PRS5_M7_SHIFT)) & AXBS_PRS5_M7_MASK)
/*! @} */

/*! @name CRS5 - Control Register */
/*! @{ */

#define AXBS_CRS5_PARK_MASK                      (0x7U)
#define AXBS_CRS5_PARK_SHIFT                     (0U)
/*! PARK - Park
 *  0b000..Park on initiator port M0.
 *  0b001..Park on initiator port M1.
 *  0b010..Park on initiator port M2.
 *  0b011..Park on initiator port M3.
 *  0b100..Park on initiator port M4.
 *  0b101..Park on initiator port M5.
 *  0b110..Park on initiator port M6.
 *  0b111..Park on initiator port M7.
 */
#define AXBS_CRS5_PARK(x)                        (((uint32_t)(((uint32_t)(x)) << AXBS_CRS5_PARK_SHIFT)) & AXBS_CRS5_PARK_MASK)

#define AXBS_CRS5_PCTL_MASK                      (0x30U)
#define AXBS_CRS5_PCTL_SHIFT                     (4U)
/*! PCTL - Parking Control
 *  0b00..When no initiator makes a request, the arbiter parks the target port on the initiator port defined by the PARK field.
 *  0b01..When no initiator makes a request, the arbiter parks the target port on the last initiator to be in control of the target port.
 *  0b10..When no initiator makes a request, the target port is not parked on a initiator and the arbiter drives all outputs to a constant safe state.
 *  0b11..Reserved
 */
#define AXBS_CRS5_PCTL(x)                        (((uint32_t)(((uint32_t)(x)) << AXBS_CRS5_PCTL_SHIFT)) & AXBS_CRS5_PCTL_MASK)

#define AXBS_CRS5_ARB_MASK                       (0x300U)
#define AXBS_CRS5_ARB_SHIFT                      (8U)
/*! ARB - Arbitration Mode
 *  0b00..Fixed priority
 *  0b01..Round-robin(RR) or rotating priority
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define AXBS_CRS5_ARB(x)                         (((uint32_t)(((uint32_t)(x)) << AXBS_CRS5_ARB_SHIFT)) & AXBS_CRS5_ARB_MASK)

#define AXBS_CRS5_HLP_MASK                       (0x40000000U)
#define AXBS_CRS5_HLP_SHIFT                      (30U)
/*! HLP - Halt Low Priority
 *  0b0..The low-power mode request has the highest priority for arbitration on this target port.
 *  0b1..The low-power mode request has the lowest initial priority for arbitration on this target port.
 */
#define AXBS_CRS5_HLP(x)                         (((uint32_t)(((uint32_t)(x)) << AXBS_CRS5_HLP_SHIFT)) & AXBS_CRS5_HLP_MASK)

#define AXBS_CRS5_RO_MASK                        (0x80000000U)
#define AXBS_CRS5_RO_SHIFT                       (31U)
/*! RO - Read Only
 *  0b0..The target port's registers are writeable.
 *  0b1..The target port's registers are read-only and cannot be written. Attempted writes do not affect the
 *       registers and result in a bus error response.
 */
#define AXBS_CRS5_RO(x)                          (((uint32_t)(((uint32_t)(x)) << AXBS_CRS5_RO_SHIFT)) & AXBS_CRS5_RO_MASK)
/*! @} */

/*! @name PRS6 - Priority Target Registers */
/*! @{ */

#define AXBS_PRS6_M0_MASK                        (0x7U)
#define AXBS_PRS6_M0_SHIFT                       (0U)
/*! M0 - Initiator 0 Priority
 *  0b000..This initiator has level 1 or highest priority when accessing the target port.
 *  0b001..This initiator has level 2 priority when accessing the target port.
 *  0b010..This initiator has level 3 priority when accessing the target port.
 *  0b011..This initiator has level 4 priority when accessing the target port.
 *  0b100..This initiator has level 5 priority when accessing the target port.
 *  0b101..This initiator has level 6 priority when accessing the target port.
 *  0b110..This initiator has level 7 priority when accessing the target port.
 *  0b111..This initiator has level 8 or the lowest priority when accessing the target port.
 */
#define AXBS_PRS6_M0(x)                          (((uint32_t)(((uint32_t)(x)) << AXBS_PRS6_M0_SHIFT)) & AXBS_PRS6_M0_MASK)

#define AXBS_PRS6_M1_MASK                        (0x70U)
#define AXBS_PRS6_M1_SHIFT                       (4U)
/*! M1 - Initiator 1 Priority
 *  0b000..This initiator has level 1 or highest priority when accessing the target port.
 *  0b001..This initiator has level 2 priority when accessing the target port.
 *  0b010..This initiator has level 3 priority when accessing the target port.
 *  0b011..This initiator has level 4 priority when accessing the target port.
 *  0b100..This initiator has level 5 priority when accessing the target port.
 *  0b101..This initiator has level 6 priority when accessing the target port.
 *  0b110..This initiator has level 7 priority when accessing the target port.
 *  0b111..This initiator has level 8 or lowest priority when accessing the target port.
 */
#define AXBS_PRS6_M1(x)                          (((uint32_t)(((uint32_t)(x)) << AXBS_PRS6_M1_SHIFT)) & AXBS_PRS6_M1_MASK)

